using System;
using System.Buffers.Binary;
using System.Collections.Generic;
using System.Runtime.CompilerServices;
using System.Runtime.InteropServices;
using LibHac.Common;
using LibHac.Diag;
using LibHac.Util;

namespace LibHac.FsSrv.Impl
{
    public static class AccessControlGlobalMethods
    {
        public static void SetDebugFlagEnabled(this FileSystemServer fsSrv, bool isEnabled)
        {
            fsSrv.Globals.AccessControl.DebugFlag = isEnabled;
        }
    }

    internal struct AccessControlGlobals
    {
        public bool DebugFlag;
    }

    /// <summary>
    /// Controls access to FS resources for a single process.
    /// </summary>
    /// <remarks>Each process has it's own FS permissions. Every time a process tries to access various FS resources
    /// or perform certain actions, this class determines if the process has the permissions to do so.
    /// <br/>Based on FS 10.0.0 (nnSdk 10.4.0)</remarks>
    public class AccessControl
    {
        private FileSystemServer FsServer { get; }
        private ref AccessControlGlobals Globals => ref FsServer.Globals.AccessControl;

        private Optional<AccessControlBits> AccessBits { get; }
        private LinkedList<ContentOwnerInfo> ContentOwners { get; } = new LinkedList<ContentOwnerInfo>();
        private LinkedList<SaveDataOwnerInfo> SaveDataOwners { get; } = new LinkedList<SaveDataOwnerInfo>();

        public AccessControl(FileSystemServer fsServer, ReadOnlySpan<byte> accessControlData,

        public bool CanOpenSaveDataInternalStorageRead() => Has(Bits.None);
        public bool CanOpenSaveDataInternalStorageWrite() => Has(Bits.None);
        public bool CanOpenSaveDataMetaFile() => Has(Bits.SaveDataMeta);
        public bool CanOpenSaveDataMover() => Has(Bits.MoveCacheStorage);
        public bool CanOpenSaveDataTransferManager() => Has(Bits.SaveDataTransfer);
        public bool CanOpenSaveDataTransferManagerForSaveDataRepair() => Has(Bits.SaveDataTransferVersion2);
        public bool CanOpenSaveDataTransferManagerForSaveDataRepairTool() => Has(Bits.None);
        public bool CanOpenSaveDataTransferManagerVersion2() => Has(Bits.SaveDataTransferVersion2);
        public bool CanOpenSaveDataTransferProhibiter() => Has(Bits.SaveDataTransferVersion2 | Bits.CreateSaveData);
        public bool CanOpenSdCardDetectionEventNotifier() => Has(Bits.DeviceDetection | Bits.SdCard);
        public bool CanOpenSdCardStorageRead() => Has(Bits.Debug | Bits.SdCard);
        public bool CanOpenSdCardStorageWrite() => Has(Bits.Debug | Bits.SdCard);
        public bool CanOpenSystemDataUpdateEventNotifier() => Has(Bits.SystemData | Bits.SystemSaveData);
        public bool CanOverrideSaveDataTransferTokenSignVerificationKey() => Has(Bits.None);
        public bool CanQuerySaveDataInternalStorageTotalSize() => Has(Bits.SaveDataTransfer);
        public bool CanReadOwnSaveDataFileSystemExtraData() => Has(Bits.CreateOwnSaveData);
        public bool CanReadSaveDataFileSystemExtraData() => Has(Bits.SystemSaveDataManagement | Bits.SaveDataManagement | Bits.SaveDataBackUp);
        public bool CanRegisterExternalKey() => Has(Bits.RegisterExternalKey);
        public bool CanRegisterProgramIndexMapInfo() => Has(Bits.RegisterProgramIndexMapInfo);
        public bool CanRegisterUpdatePartition() => Has(Bits.RegisterUpdatePartition);
        public bool CanResolveAccessFailure() => Has(Bits.AccessFailureResolution);
        public bool CanSetCurrentPosixTime() => Has(Bits.SetTime);
        public bool CanSetEncryptionSeed() => Has(Bits.ContentManager);
        public bool CanSetGlobalAccessLogMode() => Has(Bits.SettingsControl);
        public bool CanSetSdCardAccessibility() => Has(Bits.SdCard);
        public bool CanSetSpeedEmulationMode() => Has(Bits.SettingsControl);
        public bool CanSimulateDevice() => Has(Bits.Debug);
        public bool CanVerifySaveData() => Has(Bits.SaveDataManagement | Bits.SaveDataBackUp);
        public bool CanWriteSaveDataFileSystemExtraDataAll() => Has(Bits.None);
        public bool CanWriteSaveDataFileSystemExtraDataCommitId() => Has(Bits.SaveDataBackUp);
        public bool CanWriteSaveDataFileSystemExtraDataFlags() => Has(Bits.SaveDataTransferVersion2 | Bits.SystemSaveDataManagement | Bits.SaveDataBackUp);
        public bool CanWriteSaveDataFileSystemExtraDataTimeStamp() => Has(Bits.SaveDataBackUp);
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x2C)]
    internal struct AccessControlDescriptor
    {
        [FieldOffset(0x00)] public byte Version;
        [FieldOffset(0x01)] public byte ContentOwnerIdCount;
        [FieldOffset(0x02)] public byte SaveDataOwnerIdCount;
        [FieldOffset(0x04)] public ulong AccessFlags;
        [FieldOffset(0x0C)] public ulong ContentOwnerIdMin;
        [FieldOffset(0x14)] public ulong ContentOwnerIdMax;
        [FieldOffset(0x1C)] public ulong SaveDataOwnerIdMin;
        [FieldOffset(0x24)] public ulong SaveDataOwnerIdMax;
        // public ulong ContentOwnerIds[ContentOwnerIdCount];
        // public ulong SaveDataOwnerIds[SaveDataOwnerIdCount];
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x1C)]
    internal struct AccessControlDataHeader
    {
        [FieldOffset(0x00)] public byte Version;
        [FieldOffset(0x04)] public ulong AccessFlags;
        [FieldOffset(0x0C)] public int ContentOwnerInfoOffset;
        [FieldOffset(0x10)] public int ContentOwnerInfoSize;
        [FieldOffset(0x14)] public int SaveDataOwnerInfoOffset;
        [FieldOffset(0x18)] public int SaveDataOwnerInfoSize;

        // [FieldOffset(ContentOwnerInfoOffset)]
        // public int ContentOwnerInfoCount;
        // public ulong ContentOwnerIds[ContentOwnerInfoCount];

        // [FieldOffset(SaveDataOwnerInfoOffset)]
        // public int SaveDataOwnerInfoCount;
        // public byte Accessibilities[SaveDataOwnerInfoCount];
        // Next field is 4-byte aligned
        // public byte SaveDataOwnerIds[SaveDataOwnerInfoCount];
    }

    public enum OperationType
    {
        InvalidateBisCache,
        EraseMmc,
        GetGameCardDeviceCertificate,
        GetGameCardIdSet,
        FinalizeGameCardDriver,
        GetGameCardAsicInfo,
        CreateSaveData,
        DeleteSaveData,
        CreateSystemSaveData,
        CreateOthersSystemSaveData,
        DeleteSystemSaveData,
        OpenSaveDataInfoReader,
        OpenSaveDataInfoReaderForSystem,
        OpenSaveDataInfoReaderForInternal,
        OpenSaveDataMetaFile,
